# IsNumberUnique Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LoadCase..::..IsNumberUnique Method
LoadCase Class See Also
---
Checks that a given number is unique among all load cases.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static bool IsNumberUnique(
	Document document,
	int number
)
```

Visual Basic
---
```text
Public Shared Function IsNumberUnique ( _
	document As Document, _
	number As Integer _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsNumberUnique(
	Document^ document,
	int number
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document
number
    Type: System..::..Int32 The number to check.
# ### Return Value
True if the given number is unique among all load cases, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
LoadCase Class
Autodesk.Revit.DB.Structure Namespace